# Project Description
In this project, we will apply SQL concepts and functions to build our very own dashboard. Since data is never perfect, we will gain explore strategies to deal with real-world issues commonly found with SQL, including how to remove data duplication and how to turn messy data into clean, organized reports. Lastly, we'll conquer complex calculations.

In [1]:
# import packages
import os 
import sql 
import psycopg2

%load_ext sql

In [2]:
# Connect to postresql database

host = 'localhost'
database ='Olympics'
user = os.getenv('SQL_USER')
password = os.getenv('SQL_PASSWORD')

connection_string = f'postgresql://{user}:{password}@{host}/{database}'

%sql $connection_string

In [4]:
%%sql

SELECT *
  FROM pg_catalog.pg_tables
 WHERE schemaname='public';

 * postgresql://postgres:***@localhost/Olympics
5 rows affected.

[('public', 'athletes', 'postgres', None, False, False, False, False),
 ('public', 'summer_games', 'postgres', None, False, False, False, False),
 ('public', 'winter_games', 'postgres', None, False, False, False, False),
 ('public', 'countries', 'postgres', None, False, False, False, False),
 ('public', 'country_stats', 'postgres', None, False, False, False, False)]

In [5]:
%%sql

DROP VIEW IF EXISTS table_columns;

CREATE VIEW table_columns AS
SELECT table_name, STRING_AGG(column_name, ', ') AS columns
  FROM information_schema.columns
 WHERE table_schema='public'
 GROUP BY table_name;

SELECT *
  FROM table_columns;

 * postgresql://postgres:***@localhost/Olympics
Done.
Done.
6 rows affected.

[('countries', 'id, region, country'),
 ('summer_games', 'silver, gold, year, athlete_id, country_id, bronze, sport, event'),
 ('country_stats', 'country_id, gdp, nobel_prize_winners, year, pop_in_millions'),
 ('table_columns', 'table_name, columns'),
 ('winter_games', 'year, athlete_id, country_id, bronze, silver, gold, sport, event'),
 ('athletes', 'id, age, height, weight, name, gender')]

## Building the base report

Lets build the base report for this visualization:
![](photos/1.1_e2.png)

In [6]:
%%sql 

SELECT sport, COUNT(DISTINCT athlete_id) AS athletes
  FROM summer_games
 GROUP BY sport
 ORDER BY athletes
 LIMIT 3;

 * postgresql://postgres:***@localhost/Olympics
3 rows affected.

[('Gymnastics', 196), ('Swimming', 942), ('Track and Field', 2269)]

## Athletes vs events by sport

Now consider the following visualization:
![](photos/1.1_e4.png)

Lets run a query that creates the base report that sources this visualization.

In [8]:
%%sql

SELECT sport, COUNT(DISTINCT event) AS events, COUNT(DISTINCT athlete_id) AS athletes
  FROM summer_games
 GROUP BY sport;

 * postgresql://postgres:***@localhost/Olympics
3 rows affected.

[('Gymnastics', 14, 196), ('Swimming', 34, 942), ('Track and Field', 47, 2269)]

Age of Oldest Athlete by Region.

In [11]:
%%sql 

SELECT region, MAX(age) as age
  FROM countries AS c 
 INNER JOIN summer_games AS s ON c.id=s.country_id
 INNER JOIN athletes AS a ON s.athlete_id=a.id
 GROUP BY region;

 * postgresql://postgres:***@localhost/Olympics
12 rows affected.

[('C.W. OF IND. STATES', 41),
 (None, 36),
 ('EASTERN EUROPE', 39),
 ('SUB-SAHARAN AFRICA', 38),
 ('WESTERN EUROPE', 46),
 ('NORTHERN AMERICA', 41),
 ('ASIA (EX. NEAR EAST)', 44),
 ('NORTHERN AFRICA', 41),
 ('OCEANIA', 40),
 ('NEAR EAST', 40),
 ('LATIN AMER. & CARIB', 42),
 ('BALTICS', 39)]

## Number of events in each sport

Since the company will be involved in both summer sports and winter sports, it is beneficial to look at all sports in one centralized report.

We're tasked to create a query that shows the unique number of events held for each sport.

In [18]:
%%sql 

SELECT sport, COUNT(DISTINCT event)
  FROM summer_games
 GROUP BY sport

UNION

SELECT sport, COUNT(DISTINCT event)
  FROM winter_games
 GROUP BY sport;

 * postgresql://postgres:***@localhost/Olympics
6 rows affected.

[('Swimming', 34),
 ('Alpine Skiing', 10),
 ('Biathlon', 10),
 ('Track and Field', 47),
 ('Gymnastics', 14),
 ('Cross Country Skiing', 12)]

## Exploring summer_games

Exploring the data in a table can provide further insights into the database as a whole. Let's try out a series of different techniques to explore the summer_games table.

In [21]:
%%sql 

SELECT bronze, COUNT(*)
  FROM summer_games
 GROUP BY bronze;

 * postgresql://postgres:***@localhost/Olympics
2 rows affected.

[(None, 4796), (1.0, 141)]

In [23]:
%%sql 

SELECT SUM(bronze) as total_bronze_medals
  FROM summer_games;

 * postgresql://postgres:***@localhost/Olympics
1 rows affected.

[(141.0,)]

Setup a query that shows bronze_medals for summer_games by country.

In [26]:
%%sql 

SELECT SUM(bronze_medals)
  FROM (SELECT country, SUM(bronze) AS bronze_medals
          FROM countries AS c 
         INNER JOIN summer_games AS s ON c.id=s.country_id
         GROUP BY country) AS subquery;

 * postgresql://postgres:***@localhost/Olympics
1 rows affected.

[(141.0,)]

## Report 1: Most decorated summer athletes

Now that we have a good understanding of the data, let's get back to buildling out the first element for the dashboard, Most Decorated Summer Athletes:

![](photos/1.3_capstone_pic_b.png)

Let's create a base report for this visualisation. Requirements:
- Column 1 should be athlete_name.
- Column 2 should be gold_medals.
- The report should only include athletes with at least 3 medals.
- The report should be ordered by gold medals won, with the most medals at the top.

In [34]:
%%sql 

SELECT name, SUM(gold) AS gold_medals
  FROM athletes AS a 
 INNER JOIN summer_games AS s ON a.id=s.athlete_id
 GROUP BY name
HAVING SUM(gold) >= 3
 ORDER BY gold_medals DESC;

 * postgresql://postgres:***@localhost/Olympics
6 rows affected.

[('Michael Fred Phelps, II', 5.0),
 ('Kathleen Genevieve "Katie" Ledecky', 4.0),
 ('Simone Arianne Biles', 4.0),
 ('Usain St. Leo Bolt', 3.0),
 ('Katinka Hossz', 3.0),
 ('Ryan Murphy', 3.0)]

Our next goal is to create a report with the following fields:

- season, which outputs either summer or winter
- country
- events, which shows the unique number of events

In [55]:
%%sql 

SELECT season, c.country, COUNT(DISTINCT event) AS events
  FROM (SELECT 'summer' AS season, country_id, event 
          FROM summer_games

         UNION ALL

        SELECT 'winter' AS season, country_id, event 
          FROM winter_games) AS subquery
         INNER JOIN countries AS c ON subquery.country_id=c.id
 GROUP BY season, c.country
 ORDER BY events DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost/Olympics
10 rows affected.

[('summer', 'U.S.A. - United States', 94),
 ('summer', ' BRA - Brazil', 79),
 ('summer', 'G.BR - Great Britain', 78),
 ('summer', 'ger - Germany', 77),
 ('summer', 'JPN - Japan', 74),
 ('summer', '    CAN - Canada', 73),
 ('summer', 'CHN - China', 69),
 ('summer', '  AUS - Australia', 68),
 ('summer', 'fra - france', 64),
 ('summer', 'ESP - Spain', 61)]

## BMI bucket by sport

We are looking to understand how BMI differs by each summer sport. To answer this, we'll set up a report that contains the following:

- sport, which is the name of the summer sport
- bmi_bucket, which splits up BMI into three groups: <.25, .25-.30, >.30
- athletes, or the unique number of athletes

Definition: BMI = 100 * weight / (height squared).

In [63]:
%%sql 

SELECT sport,
       CASE
         WHEN (100 * weight)/POWER(height, 2) < 0.25 THEN '<.25'
         WHEN (100 * weight)/POWER(height, 2) < 0.3 THEN '.25-.30'
         WHEN (100 * weight)/POWER(height, 2) > 0.3 THEN '>.30'
       END AS bmi_bucket,
       COUNT(DISTINCT id) AS athletes
  FROM summer_games AS s 
 INNER JOIN athletes AS a ON s.athlete_id=a.id
 GROUP BY bmi_bucket, sport
 ORDER BY athletes DESC;

 * postgresql://postgres:***@localhost/Olympics
12 rows affected.

[('Track and Field', '<.25', 1886),
 ('Swimming', '<.25', 864),
 ('Gymnastics', '<.25', 190),
 ('Track and Field', '.25-.30', 174),
 ('Track and Field', '>.30', 118),
 ('Track and Field', None, 91),
 ('Swimming', '.25-.30', 46),
 ('Swimming', None, 29),
 ('Gymnastics', '.25-.30', 4),
 ('Swimming', '>.30', 3),
 ('Gymnastics', None, 1),
 ('Gymnastics', '>.30', 1)]

Next we're to create a report with the following characteristics:

- First column is bronze_medals, or the total number of bronze.
- Second column is silver_medals, or the total number of silver.
- Third column is gold_medals, or the total number of gold.
- Only summer_games are included.
- Report is filtered to only include athletes age 16 or under.

In [64]:
%%sql 

SELECT COUNT(bronze) AS bronze_medals, COUNT(silver) AS silver_medals, COUNT(gold) AS gold_medals
  FROM summer_games AS s
 INNER JOIN athletes AS a ON s.athlete_id=a.id 
 WHERE a.age <= 16;

 * postgresql://postgres:***@localhost/Olympics
1 rows affected.

[(8, 3, 2)]

In [66]:
%%sql 

SELECT COUNT(bronze) AS bronze_medals, COUNT(silver) AS silver_medals, COUNT(gold) AS gold_medals
  FROM summer_games
 WHERE athlete_id IN (SELECT id
                FROM athletes
               WHERE age <= 16);

 * postgresql://postgres:***@localhost/Olympics
1 rows affected.

[(8, 3, 2)]

## Report 2: Athletes Representing Nobel-Prize Winning Countries.

Report Details:

- Column 1 should be event, which represents the Olympic event. Both summer and winter events should be included.
- Column 2 should be gender, which represents the gender of athletes in the event.
- Column 3 should be athletes, which represents the unique athletes in the event.
- Athletes from countries that have had no nobel_prize_winners should be excluded.
- The report should contain 10 events, where events with the most athletes show at the top.

In [75]:
%%sql 

SELECT event, 
       CASE
         WHEN event LIKE '%Women%' THEN 'female'
         ELSE 'male'
         END AS gender,
       COUNT(DISTINCT athlete_id) as athletes
  FROM summer_games
 WHERE country_id IN (SELECT id 
                        FROM countries AS c
                       INNER JOIN country_stats AS cs ON c.id=cs.country_id
                       WHERE cs.nobel_prize_winners > 0)
 GROUP BY event

 UNION ALL

 SELECT event, 
       CASE
         WHEN event LIKE '%Women%' THEN 'female'
         ELSE 'male'
         END AS gender,
       COUNT(DISTINCT athlete_id) as athletes
  FROM winter_games
 WHERE country_id IN (SELECT id 
                        FROM countries AS c
                       INNER JOIN country_stats AS cs ON c.id=cs.country_id
                       WHERE cs.nobel_prize_winners > 0)
 GROUP BY event
 ORDER BY athletes DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost/Olympics
10 rows affected.

[("Swimming Women's 4 x 100 metres Medley Relay", 'female', 56),
 ("Swimming Women's 4 x 100 metres Freestyle Relay", 'female', 55),
 ("Swimming Women's 4 x 200 metres Freestyle Relay", 'female', 52),
 ("Gymnastics Women's Team All-Around", 'female', 50),
 ("Swimming Men's 4 x 200 metres Freestyle Relay", 'male', 49),
 ("Swimming Men's 4 x 100 metres Medley Relay", 'male', 45),
 ("Gymnastics Men's Team All-Around", 'male', 45),
 ("Swimming Men's 4 x 100 metres Freestyle Relay", 'male', 44),
 ("Gymnastics Women's Floor Exercise", 'female', 43),
 ("Gymnastics Women's Uneven Bars", 'female', 43)]

Get the World's GDP per year.

In [82]:
%%sql 

SELECT year, 
       DATE_PART('DECADE', year::DATE) AS decade,
       DATE_TRUNC('DECADE', year::DATE) AS decade_truncated,
       SUM(gdp) AS world_gdp
  FROM country_stats
 GROUP BY year
 ORDER BY year DESC;

 * postgresql://postgres:***@localhost/Olympics
17 rows affected.

[('2016-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 74338745046113.78),
 ('2015-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 73374945939010.72),
 ('2014-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 77951380792813.2),
 ('2013-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 75925076909004.88),
 ('2012-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 73900764024087.53),
 ('2011-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 72273505013183.55),
 ('2010-01-01', 201.0, datetime.datetime(2010, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 65112213348136.31),
 ('2009-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 59356037030185.88),
 ('2008-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 62569765568370.055),
 ('2007-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 57131118283056.32),
 ('2006-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 50739660216885.35),
 ('2005-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 46844596062932.59),
 ('2004-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 43311235354631.41),
 ('2003-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 38420317418709.625),
 ('2002-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 34240633353940.465),
 ('2001-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 32918161088103.434),
 ('2000-01-01', 200.0, datetime.datetime(2000, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 33124088837691.65)]

Pull events and golds by athlete for the summer events.

In [92]:
%%sql 

SELECT name, COUNT(event) AS total_events, ROUND(AVG(COALESCE(gold, 0))::NUMERIC, 2) AS avg_gold, SUM(COALESCE(gold,0)) AS gold_medals
  FROM athletes AS a 
 INNER JOIN summer_games AS s ON a.id=s.athlete_id
 GROUP BY name
 ORDER BY gold_medals DESC, total_events DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost/Olympics
10 rows affected.

[('Michael Fred Phelps, II', 6, Decimal('0.83'), 5.0),
 ('Simone Arianne Biles', 6, Decimal('0.67'), 4.0),
 ('Kathleen Genevieve "Katie" Ledecky', 5, Decimal('0.80'), 4.0),
 ('Katinka Hossz', 5, Decimal('0.60'), 3.0),
 ('Usain St. Leo Bolt', 3, Decimal('1.00'), 3.0),
 ('Ryan Murphy', 3, Decimal('1.00'), 3.0),
 ('Max Antony Whitlock', 7, Decimal('0.29'), 2.0),
 ('Kohei Uchimura', 7, Decimal('0.29'), 2.0),
 ('Simone Ashley Manuel', 4, Decimal('0.50'), 2.0),
 ('Madeline Jane "Maya" DiRado', 4, Decimal('0.50'), 2.0)]

## Report 3: Countries with high medal rates

Details for report 3: medals vs population rate.

- Column 1 should be country_code, which is an altered version of the country field.
- Column 2 should be pop_in_millions, representing the population of the country (in millions).
- Column 3 should be medals, representing the total number of medals.
- Column 4 should be medals_per_million, which equals medals / pop_in_millions

In [180]:
%%sql 

SELECT LEFT(REPLACE(UPPER(TRIM(country)),'.', ''), 3) AS country_code, 
       pop_in_millions,
       SUM(COALESCE(bronze, 0) + COALESCE(silver, 0) + COALESCE(gold, 0)) as medals,
       SUM(COALESCE(bronze, 0) + COALESCE(silver, 0) + COALESCE(gold, 0)) / pop_in_millions::NUMERIC as medals_per_million
  FROM countries AS c
 INNER JOIN country_stats AS cs ON c.id=cs.country_id
 INNER JOIN summer_games as s ON c.id=s.country_id AND s.year=cs.year::DATE
 WHERE cs.pop_in_millions IS NOT NULL
 GROUP BY country, pop_in_millions
 ORDER BY medals_per_million DESC
 LIMIT 25;

 * postgresql://postgres:***@localhost/Olympics
25 rows affected.

[('BAH', '0.391232', 6.0, 15.336168820546376),
 ('JAM', '2.881355', 30.0, 10.411768074395553),
 ('GRN', '0.107317', 1.0, 9.318188171491936),
 ('AUS', '24.210809', 34.0, 1.4043314289910758),
 ('BRN', '1.425171', 2.0, 1.4033403710852943),
 ('DEN', '5.72801', 6.0, 1.0474842048110948),
 ('NZL', '4.6932', 4.0, 0.8522969402539845),
 ('HUN', '9.814023', 8.0, 0.8151601030484644),
 ('TTO', '1.364962', 1.0, 0.7326211279141837),
 ('CRO', '4.174349', 3.0, 0.7186749359001846),
 ('CAN', '36.264604', 25.0, 0.6893774436362244),
 ('GBR', '65.595565', 33.0, 0.5030827922588974),
 ('USA', '323.405935', 133.0, 0.4112478640814059),
 ('QAT', '2.569804', 1.0, 0.3891347355673818),
 ('SWE', '9.923085', 3.0, 0.3023253353165875),
 ('GRE', '10.775971', 3.0, 0.2783971857385288),
 ('KEN', '48.461567', 13.0, 0.26825381028227996),
 ('NED', '17.030314', 4.0, 0.2348752935500778),
 ('BLR', '9.501534', 2.0, 0.21049232681796434),
 ('FRA', '66.859768', 14.0, 0.2093934875753682),
 ('SVK', '5.430798', 1.0, 0.18413500189106646),
 ('SGP', '5.607283', 1.0, 0.178339491693214),
 ('BEL', '11.331422', 2.0, 0.17650035450096202),
 ('JPN', '126.994511', 22.0, 0.17323583379127308),
 ('SRB', '7.058322', 1.0, 0.141676732798532)]

Our task is to pull the average total_golds for all countries within each region. This report will apply only for summer events.

In [188]:
%%sql 
SELECT region, AVG(total_gold) AS avg_gold
  FROM
    (SELECT country_id, SUM(COALESCE(gold, 0)) AS total_gold
    FROM (
            SELECT 'summer' AS season, *
            FROM summer_games
            UNION ALL
            SELECT 'winter' AS season, *
            FROM winter_games
    ) AS subquery
    -- WHERE gold IS NOT NULL
    GROUP BY country_id) AS outerquery
 INNER JOIN countries AS c ON outerquery.country_id=c.id
 GROUP BY region

 * postgresql://postgres:***@localhost/Olympics
12 rows affected.

[('C.W. OF IND. STATES', 1.3333333333333333),
 (None, 0.0),
 ('EASTERN EUROPE', 0.7333333333333333),
 ('SUB-SAHARAN AFRICA', 0.1836734693877551),
 ('WESTERN EUROPE', 2.0869565217391304),
 ('NORTHERN AMERICA', 29.0),
 ('ASIA (EX. NEAR EAST)', 0.5),
 ('NEAR EAST', 0.08333333333333333),
 ('OCEANIA', 0.4666666666666667),
 ('NORTHERN AFRICA', 0.0),
 ('LATIN AMER. & CARIB', 0.3684210526315789),
 ('BALTICS', 0.0)]

## Most decorated athlete per region

Our goal for this exercise is to show the most decorated athlete per region.

In [204]:
%%sql 

SELECT region, athlete_name, total_gold, total_silver, total_bronze
  FROM (
        SELECT region, 
               name AS athlete_name, 
               SUM(COALESCE(gold, 0)) AS total_gold,
               SUM(COALESCE(silver, 0)) AS total_silver,
               SUM(COALESCE(bronze, 0)) AS total_bronze,
               ROW_NUMBER() OVER (PARTITION BY region ORDER BY SUM(gold) DESC) AS row_number
          FROM (SELECT *
                  FROM summer_games
                UNION ALL
                SELECT *
                  FROM winter_games) AS s
        INNER JOIN athletes AS a ON a.id = s.athlete_id
        INNER JOIN countries AS c ON s.country_id = c.id
        WHERE gold > 0
        GROUP BY region, name) AS subquery
 WHERE row_number = 1;

 * postgresql://postgres:***@localhost/Olympics
9 rows affected.

[('ASIA (EX. NEAR EAST)', 'Kohei Uchimura', 2.0, 0.0, 0.0),
 ('C.W. OF IND. STATES', 'Darya Vladimirovna Domracheva', 3.0, 0.0, 0.0),
 ('EASTERN EUROPE', 'Katinka Hossz', 3.0, 0.0, 0.0),
 ('LATIN AMER. & CARIB', 'Usain St. Leo Bolt', 3.0, 0.0, 0.0),
 ('NEAR EAST', 'Ruth Jebet', 1.0, 0.0, 0.0),
 ('NORTHERN AMERICA', 'Michael Fred Phelps, II', 5.0, 0.0, 0.0),
 ('OCEANIA', 'Mackenzie "Mack" Horton', 1.0, 0.0, 0.0),
 ('SUB-SAHARAN AFRICA', 'Jemima Jelagat Sumgong', 1.0, 0.0, 0.0),
 ('WESTERN EUROPE', 'Marit Bjrgen', 3.0, 0.0, 0.0)]

Let's now calculate the percent of gdp for each country relative to the entire world and relative to that country's region

In [214]:
%%sql 

SELECT region,
       country,
       SUM(gdp) AS gdp,
       SUM(SUM(gdp)) OVER () AS global_gdp,
       SUM(gdp) / SUM(SUM(gdp)) OVER () AS perc_global_gdp,
       SUM(gdp) / SUM(SUM(gdp)) OVER (PARTITION BY region) AS prec_region_gdp
  FROM countries AS c 
 INNER JOIN country_stats AS cs ON cs.country_id=c.id
 WHERE gdp IS NOT NULL
 GROUP BY region, country
 LIMIT 10;

 * postgresql://postgres:***@localhost/Olympics
10 rows affected.

[('ASIA (EX. NEAR EAST)', 'SGP - Singapore', 3360062711809.0, 971532244286856.9, 0.0034585189854150636, 0.013167660731140979),
 ('ASIA (EX. NEAR EAST)', 'PHI - Philippines', 2958925427565.0, 971532244286856.9, 0.0030456276103702235, 0.011595654456682937),
 ('ASIA (EX. NEAR EAST)', 'IRI - Iran', 5748000000000.0, 971532244286856.9, 0.005916427410208355, 0.022525684897663528),
 ('ASIA (EX. NEAR EAST)', 'NEP - Nepal', 219641321841.0, 971532244286856.9, 0.00022607723329062066, 0.0008607465564190445),
 ('ASIA (EX. NEAR EAST)', 'JPN - Japan', 84070000000000.0, 971532244286856.9, 0.08653341203483236, 0.3294596954325979),
 ('ASIA (EX. NEAR EAST)', 'MAS - Malaysia', 3577573684210.0, 971532244286856.9, 0.00368240344594644, 0.01402005871758658),
 ('ASIA (EX. NEAR EAST)', 'IND - India', 21768000000000.0, 971532244286856.9, 0.02240584409627966, 0.08530603842246688),
 ('ASIA (EX. NEAR EAST)', ' VIE - Vietnam', 1753451840714.0, 971532244286856.9, 0.001804831338357795, 0.006871555958098758),
 ('ASIA (EX. NEAR EAST)', 'CHN - China', 90580000000000.0, 971532244286856.9, 0.09323416750464036, 0.3549715619398682),
 ('ASIA (EX. NEAR EAST)', 'AFG - Afghanistan', 196282109847.0, 971532244286856.9, 0.00020203355164097393, 0.0007692047594749655)]

## GDP per capita performance index

Next we will calculate the gdp_per_million for each country relative to the entire world.

In [226]:
%%sql 

SELECT region,
       country,
       SUM(gdp) / SUM(pop_in_millions::NUMERIC) AS gdp_per_million,
       SUM(SUM(gdp)) OVER () / SUM(SUM(pop_in_millions::NUMERIC)) OVER () AS gdp_per_million_total,
       SUM(gdp) / SUM(pop_in_millions::NUMERIC) / SUM(SUM(gdp)) OVER () / SUM(SUM(pop_in_millions::NUMERIC)) OVER () AS performance_index
  FROM country_stats AS cs
 INNER JOIN countries AS c ON cs.country_id=c.id 
 WHERE year = '2016-01-01' AND gdp IS NOT NULL
 GROUP BY region, country
 ORDER BY gdp_per_million DESC
 LIMIT 10;

 * postgresql://postgres:***@localhost/Olympics
10 rows affected.

[('WESTERN EUROPE', 'LUX - Luxembourg', 100738684222.37265, 10211871260.997988, 1.8615347797088142e-07),
 ('WESTERN EUROPE', 'SUI - Switzerland', 79896452287.00908, 10211871260.997988, 1.4763943549163648e-07),
 ('WESTERN EUROPE', '  NOR - Norway', 70875662119.09825, 10211871260.997988, 1.3097005493773408e-07),
 ('WESTERN EUROPE', 'IRL - Ireland', 64138488665.88789, 10211871260.997988, 1.1852053487809375e-07),
 ('WESTERN EUROPE', ' ISL - Iceland', 60529926755.68434, 10211871260.997988, 1.1185232836693054e-07),
 ('NEAR EAST', 'qat. - qatar', 59148479806.242035, 10211871260.997988, 1.0929957362076682e-07),
 ('NORTHERN AMERICA', 'U.S.A. - United States', 57512859187.32444, 10211871260.997988, 1.0627713522778277e-07),
 ('ASIA (EX. NEAR EAST)', 'SGP - Singapore', 55285242424.89634, 10211871260.997988, 1.0216075619113728e-07),
 ('WESTERN EUROPE', '   DEN - Denmark', 53596275146.16769, 10211871260.997988, 9.90397393192043e-08),
 ('WESTERN EUROPE', 'swe - sweden', 51798407450.90866, 10211871260.997988, 9.571748702866234e-08)]

## Report 4: Tallest athletes and % GDP by region

The final report on the dashboard is Report 4: Avg Tallest Athlete and % of world GDP by Region.

Report Details:

- Column 1 should be region found in the countries table.
- Column 2 should be avg_tallest, which averages the tallest athlete from each country within the region.
- Column 3 should be perc_world_gdp, which represents what % of the world's GDP is attributed to the region.
- Only winter_games should be included (no summer events).

In [227]:
%%sql 

SELECT region,
       AVG(height) AS avg_tallest,
       SUM(gdp) / SUM(SUM(gdp)) OVER () AS per_world_gdp
  FROM countries AS c 
 INNER JOIN (
     SELECT country_id,
            height,
            ROW_NUMBER() OVER (PARTITION BY country_id ORDER BY height DESC) AS row_num
       FROM winter_games AS w
      INNER JOIN athletes AS a ON w.athlete_id=a.id 
      GROUP BY country_id, height
      ORDER BY country_id, height DESC
 ) AS subquery ON c.id=subquery.country_id
 INNER JOIN country_stats as cs ON c.id=cs.country_id
 WHERE row_num = 1
 GROUP BY region;

 * postgresql://postgres:***@localhost/Olympics
11 rows affected.

[('EASTERN EUROPE', Decimal('184.0769230769230769'), 0.02113039882023329),
 ('SUB-SAHARAN AFRICA', Decimal('175.0000000000000000'), 0.00024291819126234164),
 ('WESTERN EUROPE', Decimal('186.0000000000000000'), 0.27321455349940443),
 ('ASIA (EX. NEAR EAST)', Decimal('175.8000000000000000'), 0.26230060480210443),
 ('NORTHERN AMERICA', Decimal('194.6666666666666667'), 0.30818335703384936),
 ('NORTHERN AFRICA', Decimal('170.0000000000000000'), 0.0015500580304604358),
 ('NEAR EAST', Decimal('175.6666666666666667'), 0.013331456238785892),
 ('OCEANIA', Decimal('185.0000000000000000'), 0.021279484372417966),
 ('LATIN AMER. & CARIB', Decimal('180.0000000000000000'), 0.06624474854637019),
 ('BALTICS', Decimal('191.6666666666666667'), 0.0014366432112723863),
 ('C.W. OF IND. STATES', Decimal('180.7272727272727273'), 0.0310857772538393)]